tap "databricks/tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "nikitabobko/tap"
# Any-to-PostScript filter
brew "a2ps"
# TIFF library and utilities
brew "libtiff"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM's OpenMP runtime library
brew "libomp"
# Text processing scripting language
brew "awk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Vector graphics library with cross-device output support
brew "cairo"
# Helper program to build and install c-like libraries
brew "cargo-c"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc@12"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Plays the game of Go
brew "gnu-go"
# Command-driven, interactive function plotting
brew "gnuplot"
# Julia installer and version multiplexer
brew "juliaup"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# High-level interpreted language for numerical computing
brew "octave"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# SOund eXchange: universal sound sample translator
brew "sox"
# Cross-shell prompt for astronauts
brew "starship"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Agent orchestration platform
cask "antigravity"
# Application uninstaller
cask "appcleaner"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client for Proton Drive
cask "proton-drive"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Menu bar customization tool
cask "swiftbar"
# Real time file synchronisation software
cask "syncthing-app"
# Customizable timing of breaks
cask "time-out"
# Unicode keyboard layout editor
cask "ukelele"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "deerawan.vscode-dash"
vscode "google.colab"
vscode "james-yu.latex-workshop"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
cargo "bob-nvim"
cargo "fd-find"
npm "neovim"
